Tekla Open API Reference for Tekla Structures 2025
Connection.Code Property
 The code of the connection. The code can be used to classify the connection. The code of the connection can be reported and shown in drawings. The maximum length of the string is 20 characters.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Code { get; set; }
Public Property Code As String
	Get
	Set
Property Value
Type: String
See Also
Reference
Connection Class
Tekla.Structures.Model Namespace